In [1]:
import pandas as pd
d=pd.read_csv("titanicship.csv")

In [2]:
d.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
d.drop(["Name","SibSp","Parch","Ticket","Embarked","PassengerId"],axis=1,inplace=True)

In [4]:
d.head()

   Pclass     Sex   Age     Fare Cabin  Survived
0       3    male  22.0   7.2500   NaN         0
1       1  female  38.0  71.2833   C85         1
2       3  female  26.0   7.9250   NaN         1
3       1  female  35.0  53.1000  C123         1
4       3    male  35.0   8.0500   NaN         0

In [5]:
target=d["Survived"]
inputs=d.drop(["Survived","Cabin"],axis=1)

In [6]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [7]:
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [8]:
dummies=pd.get_dummies(inputs["Sex"])

In [9]:
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [10]:
inter=pd.concat([inputs,dummies],axis=1)

In [11]:
inter.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [12]:
final=inter.drop(["Sex","male"],axis=1)

In [13]:
final.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [14]:
final.columns[final.isna().any()]

Index(['Age'], dtype='object')

In [15]:
final.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [16]:
means=final["Age"].mean()

In [17]:
means

29.69911764705882

In [18]:
final.Age=final.Age.fillna(means)

In [19]:
final.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [20]:
from sklearn.model_selection import train_test_split

In [21]:
X_train,X_test,y_train,y_test=train_test_split(final,target,test_size=0.2)

In [22]:
len(X_train)

712

In [23]:
len(X_test)

179

In [24]:
from sklearn.naive_bayes import GaussianNB

In [25]:
model=GaussianNB()

In [26]:
model.fit(X_train,y_train)

GaussianNB()

In [27]:
model.score(X_test,y_test)

0.7877094972067039

In [29]:
model.predict([[1,53,72.00,0]])

array([1], dtype=int64)

In [31]:
model.predict([[1,95,72.00,1]])

array([1], dtype=int64)

In [32]:
model.predict([[3,95,72.00,1]])

array([1], dtype=int64)

In [33]:

model.predict([[3,95,1.00,1]])

array([1], dtype=int64)

In [34]:
model.predict([[3,95,1.00,0]])

array([0], dtype=int64)